iysheng/rt-thread/bsp/gd32103c-eval/drivers/drv_can.c
/*
 * Copyright (c) 2006-2020, RT-Thread Development Team
 *
 * SPDX-License-Identifier: Apache-2.0
 *
 * Change Logs:
 * Date           Author         Notes
 * 2020-10-09     Yangyongsheng  the first version
 */

#include "drv_can.h"
#include <rtthread.h>
#include "gd32f10x.h"

#ifdef RT_USING_CAN

#include <rtdevice.h>

#ifdef RT_CAN_DEBUG
#define DBG_LVL               DBG_LOG
#else
#define DBG_LVL               DBG_INFO
#endif
#define DBG_TAG               "drv.CAN"
#include <rtdbg.h>

/* attention !!! baud calculation example: Tclk / ((ss + bs1 + bs2) * brp)
 * 54 / ((1 + 9 + 8) * 30) = 100kHz */
#if defined (SOC_GD32F103)/* APB1 54MHz(max) */
static const struct gd32_baud_rate_tab can_baud_rate_tab[] =
{
    {CAN100kBaud, (BAUD_DATA_SET(CAN_SJW_1TQ, SJW) \
        | BAUD_DATA_SET(CAN_BS1_9TQ, BS1) | BAUD_DATA_SET(CAN_BS2_8TQ, BS2) \
        | 30)},
};
#endif

#ifdef RT_USING_CAN0
static struct gd32_can drv_can0 =
{
    .name = "can0",
    .CanHandle = CAN1,
};
#endif

#ifdef RT_USING_CAN1
static struct gd32_can drv_can1 =
{
    "can1",
    .CanHandle = CAN2,
};
#endif

static rt_uint32_t get_can_baud_index(rt_uint32_t baud)
{
    rt_uint32_t len, index;

    len = sizeof(can_baud_rate_tab) / sizeof(can_baud_rate_tab[0]);
    for (index = 0; index < len; index++)
    {
        if (can_baud_rate_tab[index].baud_rate == baud)
            return index;
    }

    return 0; /* default baud is CAN100kBaud */
}

static rt_err_t _can_config(struct rt_can_device *can, struct can_configure *cfg)
{
    struct gd32_can *drv_can;
    rt_uint32_t baud_index;

    RT_ASSERT(can);
    RT_ASSERT(cfg);
    drv_can = (struct gd32_can *)can->parent.user_data;
    RT_ASSERT(drv_can);

    drv_can->CanParam.CAN_TTC = DISABLE;
    drv_can->CanParam.CAN_AWK = DISABLE;
    drv_can->CanParam.CAN_ABOR = DISABLE;
    drv_can->CanParam.CAN_ARD = ENABLE;
    drv_can->CanParam.CAN_RFOD = DISABLE;
    drv_can->CanParam.CAN_TFO = DISABLE;

    switch (cfg->mode)
    {
    case RT_CAN_MODE_NORMAL:
        drv_can->CanParam.CAN_Mode = CAN_MODE_NORMAL;
        break;
    case RT_CAN_MODE_LISEN:
        drv_can->CanParam.CAN_Mode = CAN_MODE_SILENT;
        break;
    case RT_CAN_MODE_LOOPBACK:
        drv_can->CanParam.CAN_Mode = CAN_MODE_LOOPBACK;
        break;
    case RT_CAN_MODE_LOOPBACKANLISEN:
        drv_can->CanParam.CAN_Mode = CAN_MODE_SILENT_LOOPBACK;
        break;
    }

    baud_index = get_can_baud_index(cfg->baud_rate);

    drv_can->CanParam.CAN_Prescaler = BAUD_DATA(RRESCL, baud_index);
    drv_can->CanParam.CAN_SJW = BAUD_DATA(SJW, baud_index);
    drv_can->CanParam.CAN_BS1 = BAUD_DATA(BS1, baud_index);
    drv_can->CanParam.CAN_BS2 = BAUD_DATA(BS2, baud_index);

    /* init can */
    if (CAN_Init(drv_can->CanHandle, &drv_can->CanParam) != \
        CAN_INITSTATE_SUCCESS)
    {
        return -RT_ERROR;
    }

    /* default filter config */
    //CAN_FilterInit(drv_can->CanHandle, &drv_can->CanFilter);

    return RT_EOK;
}

static rt_err_t _can_control(struct rt_can_device *can, int cmd, void *arg)
{
    rt_uint32_t argval;
    struct gd32_can *drv_can;
    struct rt_can_filter_config *filter_cfg;

    RT_ASSERT(can != RT_NULL);
    drv_can = (struct gd32_can *)can->parent.user_data;
    RT_ASSERT(drv_can != RT_NULL);
    switch (cmd)
    {
#if 0
    case RT_DEVICE_CTRL_CLR_INT:
        argval = (rt_uint32_t) arg;
        if (argval == RT_DEVICE_FLAG_INT_RX)
        {
            if (CAN1 == drv_can->CanHandle)
            {
                nvic_irq_disable(CAN1_RX0_IRQn);
                nvic_irq_disable(CAN1_RX1_IRQn);
            }
#ifdef RT_USING_CAN1
            if (CAN2 == drv_can->CanHandle)
            {
                nvic_irq_disable(CAN2_RX0_IRQn);
                nvic_irq_disable(CAN2_RX1_IRQn);
            }
#endif
            __HAL_CAN_DISABLE_IT(&drv_can->CanHandle, CAN_IT_RX_FIFO0_MSG_PENDING);
            __HAL_CAN_DISABLE_IT(&drv_can->CanHandle, CAN_IT_RX_FIFO0_FULL);
            __HAL_CAN_DISABLE_IT(&drv_can->CanHandle, CAN_IT_RX_FIFO0_OVERRUN);
            __HAL_CAN_DISABLE_IT(&drv_can->CanHandle, CAN_IT_RX_FIFO1_MSG_PENDING);
            __HAL_CAN_DISABLE_IT(&drv_can->CanHandle, CAN_IT_RX_FIFO1_FULL);
            __HAL_CAN_DISABLE_IT(&drv_can->CanHandle, CAN_IT_RX_FIFO1_OVERRUN);
        }
        else if (argval == RT_DEVICE_FLAG_INT_TX)
        {
            if (CAN1 == drv_can->CanHandle)
            {
                nvic_irq_disable(CAN1_TX_IRQn);
            }
#ifdef RT_USING_CAN1
            if (CAN2 == drv_can->CanHandle)
            {
                nvic_irq_disable(CAN2_TX_IRQn);
            }
#endif
            __HAL_CAN_DISABLE_IT(&drv_can->CanHandle, CAN_IT_TX_MAILBOX_EMPTY);
        }
        else if (argval == RT_DEVICE_CAN_INT_ERR)
        {
            if (CAN1 == drv_can->CanHandle)
            {
                nvic_irq_disable(CAN1_SCE_IRQn);
            }
#ifdef RT_USING_CAN1
            if (CAN2 == drv_can->CanHandle)
            {
                nvic_irq_disable(CAN2_SCE_IRQn);
            }
#endif
            __HAL_CAN_DISABLE_IT(&drv_can->CanHandle, CAN_IT_ERROR_WARNING);
            __HAL_CAN_DISABLE_IT(&drv_can->CanHandle, CAN_IT_ERROR_PASSIVE);
            __HAL_CAN_DISABLE_IT(&drv_can->CanHandle, CAN_IT_BUSOFF);
            __HAL_CAN_DISABLE_IT(&drv_can->CanHandle, CAN_IT_LAST_ERROR_CODE);
            __HAL_CAN_DISABLE_IT(&drv_can->CanHandle, CAN_IT_ERROR);
        }
        break;
#endif
    case RT_DEVICE_CTRL_SET_INT:
        argval = (rt_uint32_t) arg;
        if (argval == RT_DEVICE_FLAG_INT_RX)
        {
            __HAL_CAN_ENABLE_IT(drv_can->CanHandle, CAN_IT_RX_FIFO0_MSG_PENDING);
            __HAL_CAN_ENABLE_IT(drv_can->CanHandle, CAN_IT_RX_FIFO0_FULL);
            __HAL_CAN_ENABLE_IT(drv_can->CanHandle, CAN_IT_RX_FIFO0_OVERRUN);
            __HAL_CAN_ENABLE_IT(drv_can->CanHandle, CAN_IT_RX_FIFO1_MSG_PENDING);
            __HAL_CAN_ENABLE_IT(drv_can->CanHandle, CAN_IT_RX_FIFO1_FULL);
            __HAL_CAN_ENABLE_IT(drv_can->CanHandle, CAN_IT_RX_FIFO1_OVERRUN);

            if (CAN1 == drv_can->CanHandle)
            {
#ifdef GD32F10X_HD
                nvic_irq_enable(USB_LP_CAN1_RX0_IRQn, 1, 0);
                nvic_irq_enable(CAN1_RX1_IRQn, 1, 0);
#elif defined(GD32F10X_CL)
                nvic_irq_enable(CAN1_RX0_IRQn, 1, 0);
                nvic_irq_enable(CAN1_RX1_IRQn, 1, 0);
#endif
            }
#ifdef RT_USING_CAN1
            if (CAN2 == drv_can->CanHandle)
            {
                nvic_irq_enable(CAN2_RX0_IRQn, 1, 0);
                nvic_irq_enable(CAN2_RX1_IRQn, 1, 0);
            }
#endif
        }
        else if (argval == RT_DEVICE_FLAG_INT_TX)
        {
            __HAL_CAN_ENABLE_IT(drv_can->CanHandle, CAN_IT_TX_MAILBOX_EMPTY);

            if (CAN1 == drv_can->CanHandle)
            {
#ifdef GD32F10X_HD
                nvic_irq_enable(USB_HP_CAN1_TX_IRQn, 1, 0);
#elif defined(GD32F10X_CL)
                nvic_irq_enable(CAN1_TX_IRQn, 1, 0);
#endif
            }
#ifdef RT_USING_CAN1
            if (CAN2 == drv_can->CanHandle)
            {
                nvic_irq_enable(CAN2_TX_IRQn, 1, 0);
            }
#endif
        }
        else if (argval == RT_DEVICE_CAN_INT_ERR)
        {
            __HAL_CAN_ENABLE_IT(drv_can->CanHandle, CAN_IT_ERROR_WARNING);
            __HAL_CAN_ENABLE_IT(drv_can->CanHandle, CAN_IT_ERROR_PASSIVE);
            __HAL_CAN_ENABLE_IT(drv_can->CanHandle, CAN_IT_BUSOFF);
            __HAL_CAN_ENABLE_IT(drv_can->CanHandle, CAN_IT_LAST_ERROR_CODE);
            __HAL_CAN_ENABLE_IT(drv_can->CanHandle, CAN_IT_ERROR);

            if (CAN1 == drv_can->CanHandle)
            {
                nvic_irq_enable(CAN1_SCE_IRQn, 1, 0);
            }
#ifdef RT_USING_CAN1
            if (CAN2 == drv_can->CanHandle)
            {
                nvic_irq_enable(CAN2_SCE_IRQn, 1, 0);
            }
#endif
        }
        break;
    case RT_CAN_CMD_SET_FILTER:
        if (RT_NULL == arg)
        {
            drv_can->CanFilter.CAN_FilterWork = ENABLE;
            /* default filter config */
            CAN_FilterInit(drv_can->CanHandle, &drv_can->CanFilter);
        }
        else
        {
            filter_cfg = (struct rt_can_filter_config *)arg;
            /* get default filter */
            for (int i = 0; i < filter_cfg->count; i++)
            {
                drv_can->CanFilter.CAN_FilterNumber = filter_cfg->items[i].hdr;
                drv_can->CanFilter.CAN_FilterFIFOAssociation = \
                    filter_cfg->items[i].associate;
                drv_can->CanFilter.CAN_FilterMode = filter_cfg->items[i].mode;
                drv_can->CanFilter.CAN_FilterScale = filter_cfg->items[i].scale;

                if (drv_can->CanFilter.CAN_FilterFIFOAssociation == 1)
                {
                    rt_kprintf("111111111 filter\n");
                }
                if (drv_can->CanFilter.CAN_FilterScale == \
                    CAN_FILTERSCALE_16BIT)
                {
                    drv_can->CanFilter.CAN_FilterListHigh = \
                        ((filter_cfg->items[i].id << 5 & 0xFFE0) | \
                        (filter_cfg->items[i].rtr << 4) | \
                        (filter_cfg->items[i].ide << 3) | \
                        (filter_cfg->items[i].id >> 25 & 0x07));
                    drv_can->CanFilter.CAN_FilterListLow = \
                        ((filter_cfg->items[i].id << 5 & 0xFFE0) | \
                        (filter_cfg->items[i].rtr << 4) | \
                        (filter_cfg->items[i].ide << 3) | \
                        (filter_cfg->items[i].id >> 25 & 0x07));
                    if (drv_can->CanFilter.CAN_FilterMode == CAN_FILTERMODE_MASK)
                    {
                        drv_can->CanFilter.CAN_FilterMaskListHigh = (filter_cfg->items[i].mask >> 16) & 0xFFFF;
                        drv_can->CanFilter.CAN_FilterMaskListLow  = filter_cfg->items[i].mask & 0xFFFF;
                    }
                }
                else if (drv_can->CanFilter.CAN_FilterScale == \
                    CAN_FILTERSCALE_32BIT)
                {
                    drv_can->CanFilter.CAN_FilterListHigh = \
                        ((filter_cfg->items[i].id << 5 & 0xFFE0) | \
                        (filter_cfg->items[i].id >> 23 & 0x1f));
                    drv_can->CanFilter.CAN_FilterListLow = \
                        ((filter_cfg->items[i].id >> 10 << 3 & 0xFFF8) | \
                        (filter_cfg->items[i].rtr << 1) | \
                        (filter_cfg->items[i].ide << 2));
                    if (drv_can->CanFilter.CAN_FilterMode == CAN_FILTERMODE_LIST)
                    {
                        drv_can->CanFilter.CAN_FilterMaskListHigh = \
                            drv_can->CanFilter.CAN_FilterListHigh;
                        drv_can->CanFilter.CAN_FilterMaskListLow = \
                            drv_can->CanFilter.CAN_FilterListLow;
                    }
                    else
                    {
                        drv_can->CanFilter.CAN_FilterMaskListHigh = (filter_cfg->items[i].mask >> 16) & 0xFFFF;
                        drv_can->CanFilter.CAN_FilterMaskListLow  = filter_cfg->items[i].mask & 0xFFFF;
                    }
                }
                drv_can->CanFilter.CAN_FilterWork = ENABLE;
                /* Filter conf */
                CAN_FilterInit(drv_can->CanHandle, &drv_can->CanFilter);
            }
        }
        break;
    case RT_CAN_CMD_SET_MODE:
        argval = (rt_uint32_t) arg;
        if (argval != RT_CAN_MODE_NORMAL &&
                argval != RT_CAN_MODE_LISEN &&
                argval != RT_CAN_MODE_LOOPBACK &&
                argval != RT_CAN_MODE_LOOPBACKANLISEN)
        {
            return -RT_ERROR;
        }
        if (argval != drv_can->device.config.mode)
        {
            drv_can->device.config.mode = argval;
            return _can_config(&drv_can->device, &drv_can->device.config);
        }
        break;
    case RT_CAN_CMD_SET_BAUD:
        argval = (rt_uint32_t) arg;
        if (argval != CAN1MBaud &&
                argval != CAN800kBaud &&
                argval != CAN500kBaud &&
                argval != CAN250kBaud &&
                argval != CAN125kBaud &&
                argval != CAN100kBaud &&
                argval != CAN50kBaud  &&
                argval != CAN20kBaud  &&
                argval != CAN10kBaud)
        {
            return -RT_ERROR;
        }
        if (argval != drv_can->device.config.baud_rate)
        {
            drv_can->device.config.baud_rate = argval;
            return _can_config(&drv_can->device, &drv_can->device.config);
        }
        break;
#if 0
    case RT_CAN_CMD_SET_PRIV:
        argval = (rt_uint32_t) arg;
        if (argval != RT_CAN_MODE_PRIV &&
                argval != RT_CAN_MODE_NOPRIV)
        {
            return -RT_ERROR;
        }
        if (argval != drv_can->device.config.privmode)
        {
            drv_can->device.config.privmode = argval;
            return _can_config(&drv_can->device, &drv_can->device.config);
        }
        break;
    case RT_CAN_CMD_GET_STATUS:
    {
        rt_uint32_t errtype;
        errtype = drv_can->CanHandle->ESR;
        drv_can->device.status.rcverrcnt = errtype >> 24;
        drv_can->device.status.snderrcnt = (errtype >> 16 & 0xFF);
        drv_can->device.status.lasterrtype = errtype & 0x70;
        drv_can->device.status.errcode = errtype & 0x07;

        rt_memcpy(arg, &drv_can->device.status, sizeof(drv_can->device.status));
    }
    break;
#endif
    }

