iysheng/rt-thread/bsp/gd32103c-eval/drivers/drv_can.c
    return RT_EOK;
}

static int _can_sendmsg(struct rt_can_device *can, const void *buf, rt_uint32_t box_num)
{
    CAN_TypeDef *hcan;
    hcan = ((struct gd32_can *) can->parent.user_data)->CanHandle;
    struct rt_can_msg *pmsg = (struct rt_can_msg *) buf;
    CanTxMessage txheader = {0};
    /* Check the parameters */
    RT_ASSERT(pmsg->len <= 0x08);

    /* check select mailbox is empty */
    switch (1 << box_num)
    {
    case 1:
        if (IS_BIT_SET(hcan->TSTR, CAN_TSTR_TME0) != SET)
        {
            /* Return function status */
            return -RT_ERROR;
        }
        break;
    case 2:
        if (IS_BIT_SET(hcan->TSTR, CAN_TSTR_TME1) != SET)
        {
            /* Change CAN state */
            /* Return function status */
            return -RT_ERROR;
        }
        break;
    case 4:
        if (IS_BIT_SET(hcan->TSTR, CAN_TSTR_TME2) != SET)
        {
            /* Change CAN state */
            /* Return function status */
            return -RT_ERROR;
        }
        break;
    default:
        RT_ASSERT(0);
        break;
    }

    if (RT_CAN_STDID == pmsg->ide)
    {
        txheader.FF = CAN_ID_STD;
        RT_ASSERT(IS_CAN_STDID(pmsg->id));
        txheader.StdId = pmsg->id;
    }
    else
    {
        txheader.FF = CAN_ID_EXT;
        RT_ASSERT(IS_CAN_EXTID(pmsg->id));
        txheader.ExtId = pmsg->id;
    }

    if (RT_CAN_DTR == pmsg->rtr)
    {
        txheader.FT = CAN_RTR_DATA;
    }
    else
    {
        txheader.FT = CAN_RTR_REMOTE;
    }
    /* Set up the Id */
    if (RT_CAN_STDID == pmsg->ide)
    {
        hcan->TxMailBox[box_num].TMIR &= \
            ~(CAN_TMIR_StdId_Mask << CAN_TMIR_STID_POS);
        hcan->TxMailBox[box_num].TMIR &= \
            ~(1 << CAN_TMIR_FT_POS);
        hcan->TxMailBox[box_num].TMIR &= \
            ~(1 << CAN_TMIR_FF_POS);
        hcan->TxMailBox[box_num].TMIR |= (txheader.StdId << CAN_TMIR_STID_POS);
        hcan->TxMailBox[box_num].TMIR |= txheader.FT;
        hcan->TxMailBox[box_num].TMIR |= txheader.FF;
    }
    else
    {
        hcan->TxMailBox[box_num].TMIR &= \
            ~(CAN_TMIR_ExtId_Mask << CAN_TMIR_EXTID_POS);
        hcan->TxMailBox[box_num].TMIR &= \
            ~(1 << CAN_TMIR_FT_POS);
        hcan->TxMailBox[box_num].TMIR &= \
            ~(1 << CAN_TMIR_FF_POS);
        hcan->TxMailBox[box_num].TMIR |= (txheader.ExtId << CAN_TMIR_EXTID_POS) | txheader.FF | txheader.FT;
    }
    /* Set up the DLC */
    hcan->TxMailBox[box_num].TMPR = pmsg->len & 0x0FU;
    /* Set up the data field */
    WRITE_REG(hcan->TxMailBox[box_num].TMD1R,
              ((uint32_t)pmsg->data[7] << 24) |
              ((uint32_t)pmsg->data[6] << 16) |
              ((uint32_t)pmsg->data[5] << 8) |
              ((uint32_t)pmsg->data[4]));
    WRITE_REG(hcan->TxMailBox[box_num].TMD0R,
              ((uint32_t)pmsg->data[3] << 24) |
              ((uint32_t)pmsg->data[2] << 16) |
              ((uint32_t)pmsg->data[1] << 8) |
              ((uint32_t)pmsg->data[0]));
    /* Request transmission */
    SET_BIT(hcan->TxMailBox[box_num].TMIR, CAN_TMIR0_TE);

    return RT_EOK;
}

static int _can_recvmsg(struct rt_can_device *can, void *buf, rt_uint32_t fifo)
{
    uint8_t len;
    CAN_TypeDef *hcan;
    struct rt_can_msg *pmsg;

#if 1
    CanRxMessage rxmsg = {0};
    RT_ASSERT(can);

    hcan = ((struct gd32_can *)can->parent.user_data)->CanHandle;
    pmsg = (struct rt_can_msg *) buf;

    /* get data */
    len = CAN_Receive(hcan, fifo, &rxmsg);
    if (0 == len)
        return -RT_ERROR;
    /* get id */
    if (CAN_ID_STD == rxmsg.FF)
    {
        pmsg->ide = RT_CAN_STDID;
        pmsg->id = rxmsg.StdId;
    }
    else
    {
        pmsg->ide = RT_CAN_EXTID;
        pmsg->id = rxmsg.ExtId;
    }
    /* get type */
    if (CAN_RTR_DATA == rxmsg.FT)
    {
        pmsg->rtr = RT_CAN_DTR;
    }
    else
    {
        pmsg->rtr = RT_CAN_RTR;
    }
    /* get len */
    pmsg->len = rxmsg.DLC;
    rt_memcpy(pmsg->data, rxmsg.Data, rxmsg.DLC);
    /* get hdr */
    if (hcan == CAN1)
    {
        pmsg->hdr = (rxmsg.FI + 1) >> 1;
    }
#ifdef RT_USING_CAN1
    else if (hcan == CAN2)
    {
       pmsg->hdr = (rxmsg.FI>> 1) + 14;
    }
#endif
#endif

    return RT_EOK;
}


static const struct rt_can_ops _can_ops =
{
    _can_config,
    _can_control,
    _can_sendmsg,
    _can_recvmsg,
};

static void _can_rx_isr(struct rt_can_device *can, rt_uint32_t fifo)
{
    CAN_TypeDef *hcan;
    RT_ASSERT(can);
    hcan = ((struct gd32_can *) can->parent.user_data)->CanHandle;

    switch (fifo)
    {
    case CAN_RX_FIFO0:
        /* Check Overrun flag for FIFO0 */
        if (hcan->RFR0 & CAN_RX_RFO)
        {
            /* Clear FIFO0 Overrun Flag */
            SET_BIT(hcan->RFR0, CAN_RX_RFO);
            rt_hw_can_isr(can, RT_CAN_EVENT_RXOF_IND | fifo << 8);
        }

        /* save to user list */
        if (CAN_MessageLength(hcan, CAN_RX_FIFO0))
        {
            rt_hw_can_isr(can, RT_CAN_EVENT_RX_IND | fifo << 8);
        }

        /* Check FULL flag for FIFO0 */
        if (hcan->RFR0 & CAN_RX_RFF)
        {
            /* Clear FIFO0 FULL Flag */
            SET_BIT(hcan->RFR0, CAN_RX_RFF);
        }

        break;
    case CAN_RX_FIFO1:
        /* Check Overrun flag for FIFO0 */
        if (hcan->RFR1 & CAN_RX_RFO)
        {
            /* Clear FIFO0 Overrun Flag */
            SET_BIT(hcan->RFR1, CAN_RX_RFO);
            rt_hw_can_isr(can, RT_CAN_EVENT_RXOF_IND | fifo << 8);
        }

        /* save to user list */
        if (CAN_MessageLength(hcan, CAN_RX_FIFO1))
        {
            rt_hw_can_isr(can, RT_CAN_EVENT_RX_IND | fifo << 8);
        }

        /* Check FULL flag for FIFO0 */
        if (hcan->RFR1 & CAN_RX_RFF)
        {
            /* Clear FIFO0 FULL Flag */
            SET_BIT(hcan->RFR1, CAN_RX_RFF);
        }
        break;
    }
}

#ifdef RT_USING_CAN0
/**
 * @brief This function handles CAN1 TX interrupts. transmit fifo0/1/2 is empty can trigger this interrupt
 */
void USBD_HP_CAN0_TX_IRQHandler(void)
{
    rt_interrupt_enter();
    CAN_TypeDef *hcan;
    hcan = drv_can0.CanHandle;

    if (IS_BIT_SET(hcan->TSTR, CAN_IT_MTF0_FINISH))
    {
        if (IS_BIT_SET(hcan->TSTR, CAN_IT_MTFNERR0_FINISH))
        {
            rt_hw_can_isr(&drv_can0.device, RT_CAN_EVENT_TX_DONE | 0 << 8);
        }
        else
        {
            rt_hw_can_isr(&drv_can0.device, RT_CAN_EVENT_TX_FAIL | 0 << 8);
        }
        /* Write 0 to Clear transmission status flag RQCPx */
        SET_BIT(hcan->TSTR, CAN_IT_MTF0_FINISH);
    }
    else if (IS_BIT_SET(hcan->TSTR, CAN_IT_MTF1_FINISH))
    {
        if (IS_BIT_SET(hcan->TSTR, CAN_IT_MTFNERR1_FINISH))
        {
            rt_hw_can_isr(&drv_can0.device, RT_CAN_EVENT_TX_DONE | 1 << 8);
        }
        else
        {
            rt_hw_can_isr(&drv_can0.device, RT_CAN_EVENT_TX_FAIL | 1 << 8);
        }
        /* Write 0 to Clear transmission status flag RQCPx */
        SET_BIT(hcan->TSTR, CAN_IT_MTF1_FINISH);
    }
    else if (IS_BIT_SET(hcan->TSTR, CAN_IT_MTF2_FINISH))
    {
        if (IS_BIT_SET(hcan->TSTR, CAN_IT_MTFNERR2_FINISH))
        {
            rt_hw_can_isr(&drv_can0.device, RT_CAN_EVENT_TX_DONE | 2 << 8);
        }
        else
        {
            rt_hw_can_isr(&drv_can0.device, RT_CAN_EVENT_TX_FAIL | 2 << 8);
        }
        /* Write 0 to Clear transmission status flag RQCPx */
        SET_BIT(hcan->TSTR, CAN_IT_MTF2_FINISH);
    }
    rt_interrupt_leave();
}

/**
 * @brief This function handles CAN1 RX0 interrupts.
 */
void USBD_LP_CAN0_RX0_IRQHandler(void)
{
    rt_interrupt_enter();
    _can_rx_isr(&drv_can0.device, CAN_RX_FIFO0);
    rt_interrupt_leave();
}

/**
 * @brief This function handles CAN1 RX1 interrupts.
 */
void CAN0_RX1_IRQHandler(void)
{
    rt_interrupt_enter();
    _can_rx_isr(&drv_can0.device, CAN_RX_FIFO1);
    rt_interrupt_leave();
}

/**
 * @brief This function handles CAN0 EWMC interrupts.
 */
void CAN0_EWMC_IRQHandler(void)
{
    rt_uint32_t errtype;
    CAN_TypeDef *hcan;

    hcan = drv_can0.CanHandle;
    errtype = hcan->ER;

	rt_kprintf("err--------, errtype=%x\n", errtype);
    rt_interrupt_enter();
#if 0
    HAL_CAN_IRQHandler(hcan);

